## Objective - Use pandas to collect and clean clean salary data to be saved in csv for later merging to other features.

In [9]:
import pandas as pd 



df = pd.read_html('https://mlsplayers.org/resources/salary-guide')

In [10]:
salary = df[0]
salary.head()

,First Name,Last Name,Club,Position(s),Base Salary,Guaranteed Compensation
0,Ilsinho,NaN,Philadelphia Union,M,"$450,000.00","$501,250.00"
1,Judson,NaN,San Jose Earthquakes,M,"$360,000.00","$365,000.00"
2,Auro,NaN,Toronto FC,D,"$360,000.00","$388,750.00"
3,Paxten,Aaronson,Philadelphia Union,M,"$87,500.00","$91,500.00"
4,Saad,Abdul-Salaam,Columbus Crew,D,"$125,000.00","$133,667.00"

In [11]:
salary.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 871 entries, 0 to 870
Data columns (total 6 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   First Name               871 non-null    object
 1   Last Name                868 non-null    object
 2   Club                     871 non-null    object
 3   Position(s)              863 non-null    object
 4   Base Salary              871 non-null    object
 5   Guaranteed Compensation  871 non-null    object
dtypes: object(6)
memory usage: 41.0+ KB

In [12]:
salary['Last Name'].isna().value_counts()

False    868
True       3
Name: Last Name, dtype: int64

In [13]:
salary['Last Name']= salary['Last Name'].fillna('')

In [14]:
salary['name'] = salary['First Name']+ ' '+salary['Last Name']
salary['name'][:4]

0           Ilsinho
1            Judson
2              Auro
3    Paxten Aaronson
Name: name, dtype: object

In [16]:

salary.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 871 entries, 0 to 870
Data columns (total 7 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   First Name               871 non-null    object
 1   Last Name                871 non-null    object
 2   Club                     871 non-null    object
 3   Position(s)              863 non-null    object
 4   Base Salary              871 non-null    object
 5   Guaranteed Compensation  871 non-null    object
 6   name                     871 non-null    object
dtypes: object(7)
memory usage: 47.8+ KB

In [19]:

salary.to_csv('../data/player_salary.csv')